camera_configs = {
    0: {
        "rtsp_url": "rtsp://cxview:gs252525@115.78.133.22:554/Streaming/Channels/501",
        "zone_1": [
            (0.591, 0.172),  # Điểm 1
            (0.545, 0.177),  # Điểm 2
            (0.718, 0.991),  # Điểm 3
            (0.870, 0.987)   # Điểm 4
        ],
        "zone_2": [
            (0.608, 0.01),  # Điểm 1
            (0.595, 0.156),    # Điểm 2
            (0.860, 0.995),     # Điểm 3
            (0.993, 0.995),      # Điểm 4
            (0.993, 0.283),      # Điểm 5
        ],
        "track_person": {},
        "current_frame": 0
    },
    1: {
        "rtsp_url": "rtsp://cxview:gs252525@115.78.133.22:554/Streaming/Channels/1101",
        "zone_1": [
            (0.381, 0.160),  # Điểm 1
            (0.304, 0.160),  # Điểm 2
            (0.218, 0.8),  # Điểm 3
            (0.479, 0.8)   # Điểm 4
        ],
        "zone_2": [
            (0.56875, 0.09375),  # Điểm 1
            (0.4312, 0.0854),    # Điểm 2
            (0.4083, 0.377),     # Điểm 3
            (0.481, 0.993),      # Điểm 4
            (0.787, 0.993),      # Điểm 5
            (0.887, 0.654),      # Điểm 6
        ],
        "track_person": {},
        "current_frame": 0
    },
    2: {
        "rtsp_url": "rtsp://cxview:gs252525@115.78.133.22:554/Streaming/Channels/601",
        "zone_1": [
            (0.175, 0.097),  # Điểm 1
            (0.125, 0.106),  # Điểm 2
            (0.206, 0.981),  # Điểm 3
            (0.381, 0.912)   # Điểm 4
        ],
        "zone_2": [
            (0.318, 0.01),  # Điểm 1
            (0.193, 0.01),  # Điểm 2
            (0.183, 0.116),  # Điểm 3
            (0.216, 0.266),   # Điểm 4
            (0.408, 0.939),  # Điểm 5
            (0.610, 0.847),  # Điểm 6
            (0.629, 0.297),  # 7
        ],
        "track_person": {},
        "current_frame": 0
    },
}
